<?php
$tbl_sys_msg = array(
	"no_same_id"	 => "返回的游戏ID和发送的不一致",
	"return"			 => "返回",
	"refurbish"		 => "刷新",
	"close"				 => "关闭",
	"ok"					 => "确定",
	"clear"				 => "清空",
	"today"				 => "今天",
	"all_server"	 => "全区全服",
	"selected"		 => "选中的内容",
	"md5error"		 => "MD5签名错误",
	"ip_error"		 => "IP非法",
	"unknow_err"	 => "未知错误",
	"hour"				 => "时",
	"minute"			 => "分",
	"second"			 => "秒",
	"year"				 => "年",
	"day"					 => "天",
	"weeks"				 => array("日","一","二","三","四","五","六"),
	"months"			 => array("一月","二月","三月","四月","五月","六月","七月","八月","九月","十月","十一月","十二月"),
	
	"level"				 => "等级",
	"class"				 => "职业",
	"total"				 => "总量",
	"count"				 => "次数",
	"camp"	       => "阵营",
	"server"       => "服务器",
	"time"				 => "时间",
	"sex"					 => "性别",
	"skill"				 => "技能",
	
	"online"			 => "在线",
	"offline"			 => "离线",
	
	"on"					 => "开启",
	"off"					 => "关闭",
	
	"edit"				 => "编辑",
	"act"					 => "操作", 
	"detail"			 => "详细",
	"delete"			 => "删除",
	"pass"				 => "通过",
	"cancel"			 => "取消",
	"status"			 => "状态",
	"desc"				 => "描述",
	"rank"				 => "排序",
	
	"success"			 => "操作成功",
	"nobody"			 => "没有找到指定的对象，请检查用户名、物品名称等信息是否正确。",
	"reason"			 => "理由",
	
	"submit"			 => "提交",
	"search"			 => "搜索",
	"all"					 => "全部",
	"download"		 => "下载",
	"insert"			 => "插入",
	
	"gold"				 => "金",
	"silver"			 => "银",
	"copper"			 => "铜",
	
	"LastLogTime"	 => "查看日志更新时间",

	"check_chat"	 => "检查消息记录完成。",
	"read"				 => "标为已读",
	"Max_Latency"	 => "最大延迟",
	"admin"				 => "管理员",
	"delete_sure"	 => "确定要删除吗？",
	
	"MoneyType1"	 => "流通金",
	"MoneyType2"	 => "绑定金",
	
	"CreateTime"	 => "创建时间",
	"LastLoginTime"=> "上次登录时间",
	"LastLogoutTime"=> "上次登出时间",
	"Executor"		 => "执行者",
	"EnterType"		 => "输入类型",
	"Log"					 => "日志",
	
	"from"				 => "从",
	"to"					 => "到",
	"result"			 => "结果",
	
	"SingleServer" => "单服",
	"AllServer"		 =>	"全服",
	
	"enter"				 => "进入",
	"leave"				 => "离开",
	
	"new_name"		 => "新名称",
);

$tbl_recruit = array("普通招募","高级招募");

$tbl_tong_msg = array(
	"honor"				 => "荣誉",
	"level"				 => "等级",
	"money"				 => "资金",
	"resource"		 => "军资",
	"develop"			 => "发展度",
	"member_event" => array("","加入","踢出","退出","更改"),
	"technology_event"	=> array("","开始研发","停止研发","完成研发","科技重置"),
	"build_event"	 => array("","放置建筑","拆除摧毁建筑"),
	"produce_event"=> array("","开始","取消","完成制造"),
	"station_event"=> array("","挑战占领","挑战被占领","国战占领","国战被占领","主动撤退","帮会解散撤退","挑战放弃"),
	"war_zone"		 => array("副本","花语平原第一战区","花语平原第二战区"),
	"station_name" => array(
		0	=> "副本驻地",
		111	=> "艾米帝国飞龙主营",
		121	=> "艾米帝国雄鹰左翼",
		122	=> "艾米帝国狮心后防",
		123	=> "艾米帝国狂鹫右翼",
		211	=> "神圣教廷光明主营",
		221	=> "神圣教廷天护左翼",
		222	=> "神圣教廷使命后防",
		223	=> "神圣教廷地佑右翼",
		311	=> "休斯帝国黑曜主营",
		321	=> "休斯帝国钢铁左翼",
		322	=> "休斯帝国铁血后防",
		323	=> "休斯帝国磐石右翼",
	),
	"challenge_result" => array("失败","成功"),
);

$tbl_joint_sales_status = array("下架","上架");

$tbl_server_type = array("普通服务器","一星服务器","二星服务器","皇冠服务器");

$tbl_channel = array(
	0		=> "全部",
	1		=> "系统",
	2		=> "世界",
	3		=> "阵营",
	4		=> "地图",
	5		=> "附近",
	6		=> "队伍",
	7		=> "佣兵小队",
	8		=> "佣兵团",
	10	=> "传声",
);

$tbl_jifen = array(
	"金钱",
	"矮人积分",
	"森林积分",
	"夜影积分",
	"魔法积分",
	"探险积分",
	"比赛积分",
	"击杀积分",
	"训练积分",
	"对抗积分",
	"国贡积分",
);

$bid2type = array(
	1  => "普通物品",
	2  => "背包",
	3  => "技能物品",
	5  => "武器",
	6  => "防具",
	7  => "暗器",
	8  => "戒指",
	9  => "饰品",
	10 => "帮会物品",
	14 => "宝石",
	15 => "打孔材料",
	16 => "任务物品",
	17 => "邮件物品",
	18 => "白宝石",
	19 => "魂珠",
	23 => "帮会炼金物品",
	24 => "盒子物品",
	25 => "文本物品",
	26 => "阵法书",
	27 => "锻造主材料",
	28 => "锻造品质材料",
	29 => "商会运输车",
	30 => "矿藏图",
	31 => "装备鉴定卷轴",
	32 => "种花物品",
	34 => "护甲片",
	36 => "装备炼化卷轴",
	37 => "修行塔卡牌",
	38 => "进阶石",
	39 => "帮会挑战物品",
	40 => "召唤NPC道具",
	41 => "宠物蛋",
	42 => "宠物技能石",
	43 => "大重铸石",
	45 => "采矿工具",
	46 => "商城道具",
	47 => "商城道具宝箱",
	48 => "经验瓶、魂瓶",
	49 => "精炼石",
	50 => "装备追加石",
);

$tbl_camp = array(
	"无",
	"艾米",
	"神圣",
	"修斯",
	"路人",
	"怪物",
	"混乱",
	"帮会1",
	"帮会2",
	"帮会3",
	"没有任何任务和交互功能的路人",
	"和0,5为敌对阵营,其他都为友方",
);

$tbl_class = array(
	"无职业",
	"大剑士",
	"魔剑士",
	"骑士",
	"法师",
	"邪魔",
	"牧师",
	"矮人骑士",
	"精灵弓箭手",
	"兽人战士",
	"NPC",
	"巫师",
	"刺客",
	"邪恶法师	",
	"战牧  ",
	"弓箭手",
	"大战士",
	"召唤师",
	"野兽",
	"召唤生物",
	"攻击骑士",
	"防御骑士",
	"自然元素",
	"暗黑元素",
	"破坏元素",
);

$tbl_tong_boss = array(
	"Qk9TU9X5tuFCT1NT"	=>	"领主（圣雪山）",
	"Qk9TU9X5tuFCT1NTMQ"	=>	"领主（狮子河）",
	"Qk9TU9X5tuFCT1NTMg"	=>	"领主（河阳）",
);

$tbl_commerce_skill = array(
	"xevivw"	=>	"烹饪",
	"1v281w"	=>	"铸甲",
	"1sbSqQ"	=>	"制药",
	"ssm-8w"	=>	"采矿",
	"ts3U7A"	=>	"锻造",
	"uaTS1Q"	=>	"工艺",
	"u6i73A"	=>	"花卉",
);

$tbl_part = array( "无", "主手", "副手", "头部", "衣服", "腰带", "护腕", "鞋子", "戒指左", "戒指右", "项链", "佩饰", "披风", "外套", "肩部", "护手", "背部");

$tbl_tong_pos = array(
	"未定义",
	"队员",
	"精英队员",
	"王牌",
	"副队长",
	"队长",
);

$tbl_tong_page = array(
	"","公共物品","队长物品","营长物品","副团长物品","团长物品"
);

$tbl_error_msg = array (
	"NoPriv" => "你没有该权限",
	"ActionFail" => "操作未成功",
	"PostDataFail" => "操作失败，请重试。(Error code: %s)",
	"MsgTooLang" => "向服务器发送的消息过长，请减少要发送的数据量（除角色名外）。",
	"MySQLError" => "数据库查询错误。(Error code: %3\$s)<br/>服务器：%1\$s<br/>数据库：%2\$s<br/>查询: %4\$s",
	"MySQLConnect" => "不能连接到数据库。",
);

$tbl_mysql_connect_type = array(
	"Game" => "游戏库",
	"Log" => "日志库",
	"GameLog" => "游戏辅助库"
);

$tbl_list_bulletin_state=array("已提交","已通过","已删除","已开始");

$tbl_list_compensate = array("记录不存在","等待处理","已取消","已完成");

$tbl_list_task=array("","进行中","","已完成","");

$tbl_tong_detail=array("帮会名","会长","阵营","帮会id","建立时间","帮会声望","帮会等级","帮会基金","帮会资源","帮会宗旨","帮会仓库ID","帮会人数","驻地");

$tbl_tong_list_member=array(
	array("角色名", "角色ID", "等级", "职务", "贡献", "入帮时间"),
	array("移除","变更职位")
);

$tbl_tong_depot=array(
	"帮会仓库",
	array("物品名称","物品分类","所在页","位置","数量"),
);

$tbl_list_tong=array(
	"帮会信息查询",
	array("帮会名称","人数","创建者","阵营","声望","等级","查看日志"),
	array("详细","成员","仓库","更名","修改等级"),
	array("成员","物品"),
	array("请输入新帮会名"),
	array("奖励物品名","仓库","数量","佣兵团仓库奖励")
);

$AddItemToTong = "管理员将%1\$d个%2\$s放入了%3\$s";
$DelItemInTongDepot = "管理员从%1\$s删除了%2\$d个%3\$s";
$ChangeTongMember = array("管理员将%1\$s%2\$s职位转移为%3\$s","，原团长变更为副团长");
$RemoveTongMember = "%s被管理员剔除本团";

$tbl_role_all_detail = array(
	"角色：<b>%s</b> 的详细信息如下:",
	"角色详情",
	"角色位置",
	"包裹物品",
	"角色装备",
	"仓库物品",
	"角色技能",
	"请输入理由",
	"请输入要删除的数量",
	"您输入的数量错误",
	"角色详细信息",
	"角色排行",
	"角色称谓",
	"邮箱中的物品",
	"寄售交易所中的物品",
	"查看角色物品信息",
	"查看角色社会关系",
	"角色：<b>%s</b> 的物品信息如下:",
	"角色：<b>%s</b> 的社会关系如下:",
	"在线/最近登录信息",
	"查看角色实时数据",
	"角色：<b>%s</b> 的实时数据如下:",
	"符石情况",
);

$tbl_sex = array("无","男","女");

$tbl_role_sort = array(
	array("排行名称","名次","升降","信息"),
	array(
		"level" 			=> array("等级榜","%d级"),
		"money"				=> array("财富榜","%d金%d银%d铜"),
		"dead"				=> array("死亡榜","%d次"),
		"kill_player"	=> array("杀人榜","%d人次"),
		"kill_npc"		=> array("累计杀怪榜","%d只"),
		"online"			=> array("在线时间榜","%d天%d时%d分%d秒"),
	)
);

$tbl_role_appellation = array(
	"当前称谓",
	array("称谓")
);
  
$tbl_role_item_room = '在第%d个背包，槽位是%d';
$tbl_role_item_room1= '在主背包，槽位是%d';

$tbl_role_mail_item = array(
	"邮件题目","发信人"
);

$tbl_role_stone = array(
	"符印","位置","符石",
	array(
		1=>"日之符印",
		2=>"爱之符印",
		5=>"智之符印",
		6=>"月之符印",
		9=>"水之符印",
		10=>"光之符印",
	),
);

$tbl_role_friends = array(
	"好友信息",
	array("所在分组","好友名称","阵营","职业","等级","性别","我的好友"),
	"黑名单",
	array("角色名称","阵营","职业","等级","性别"),
	"好友群",
	array("群名称","群内职务","成员数",array("","群主","管理员","成员")),
	"帮会",
	array("帮会名称","帮会职务","成员数"),
	"查询角色社会关系",
);

$tbl_user_type = array("正常角色","已删除角色");
$tbl_user_role_list_function = array(
	"删除角色","恢复角色","角色改名","新角色名"
);

$tbl_user_login = array(
	"帐号登录信息",
	array("登录时间","登录IP"),
	"IP登录信息",
	array("登录时间","角色名")
);
  
$tbl_page = array(
	"跳转到第&nbsp;%s&nbsp;页","&nbsp;/&nbsp;%d&nbsp;页，","共&nbsp;%d&nbsp;条记录，%d&nbsp;条记录&nbsp;/&nbsp;页","下载所有页"
);
  
$tbl_hot_update_log = array(
	"类型/时间/文件名/操作","代码","","查看","热更新日志","查看结果",
);
  
$tbl_hot_update_Result = array(
	"服务器Id","状态","完成时间","查看热更新结果","热更新详情","结果如下：",
);
  
$tbl_hot_update_type = array(
	"","主线程","数据库线程","客户端"
);
  
$tbl_hot_update_state = array(
	"-","成功",
);

$tbl_get_server_date = "当前时间";
  
$tbl_talk = array(
	"send" => "发送消息",
	"reflesh" => "刷新消息",
	"older" => "查看更早消息",
	"me" => "我",
	"AllMsg"=>"查看所有消息",
	"reason"=>"GM聊天",
);
  
$tbl_npc_info = array(
	"基本信息","任务","物品掉落","掉率","商店"
);
  
$tbl_money_binding = array(
	"全部","流通金","绑定金"
);
  
$tbl_channel_word = array(
	"聊天监控-敏感词管理",
	array("敏感词","删除"),
	"新增",
	"聊天监控-新增敏感词",
	"新增敏感词“%s”成功。<br/>重新检查消息记录，可能需要几分钟。",
	"聊天监控-删除敏感词",
	"删除敏感词“%s”成功。<br/>重新检查消息记录，可能需要几分钟。",
);

$tbl_list_complaint=array("","外挂举报","技能","任务","怪物","金钱奖励","物品","玩法副本","美术资源","其他");
  
$tbl_event_type = array(
	0		=>"全部",
	1		=>"npc商店购买",
	2		=>"npc商店出售",
	3		=>"邮寄",
	4		=>"创建佣兵小队",
	5		=>"锻造铸甲",
	6		=>"捐献",
	7		=>"领取",
	8		=>"烹饪制药",
	9		=>"物品使用",
	10	=>"左键点击删除",
	11	=>"寄售",
	12	=>"任务品或者道具物品删除",
	13	=>"GM删除物品",
	14	=>"盒子物品删除",
	15	=>"装备炼化",
	16	=>"添加出售订单",
	17	=>"寄售交易所出售",
	18	=>"寄售交易所购买",
	19	=>"手动删除出售订单",
	20	=>"系统删除出售订单",
	22	=>"自由拾取物品",
	23	=>"角色初始化产生装备",
	24	=>"阵法还原成阵法书",
	25	=>"GM添加物品",
	26	=>"盒子物品掉落",
	27	=>"合成",
	28	=>"白宝石鉴定",
	29	=>"宝石摘除",
	30	=>"装备炼化魂珠",
	31	=>"新邮件",
	32	=>"副本奖励",
	33	=>"掉落拍卖",
	34	=>"淬炼",
	35	=>"锻造",
	36	=>"生产",
	37	=>"离线种花产出",
	38	=>"炮塔钥匙产出",
	39	=>"道具产出",
	40	=>"复活石使用",
	41	=>"帮会建筑物品产出",
	42	=>"任务奖励",
	43	=>"任务品或者道具给予",
	45	=>"点npc给物品",
	46	=>"领取机械兽",
	47	=>"在线种花产出",
	48	=>"拍卖获得物品",
	49	=>"采集单个格子的物品",
	50	=>"采集所有格子的物品",
	51	=>"平均分配拾取物品",
	52	=>"需求分配",
	53	=>"任务掉落物品",
	54	=>"点npc尸体掉落(点一个格子)",
	55	=>"装备洗白",
	56	=>"踩trap给物品",
	57	=>"点npc尸体掉落(点所有格子)",
	58	=>"杀人获得经验",
	59	=>"杀怪获得经验",
	60	=>"使用经验球获得经验",
	61	=>"GM指令加经验",
	62	=>"使用魂珠加魂值",
	63	=>"小游戏",
	64	=>"爆魂",
	65	=>"死亡掉魂",
	66	=>"杀人加魂",
	67	=>"装备强化灌输魂",
	68	=>"技能物品添加",
	69	=>"角色初始化携带技能物品",
	70	=>"玩家踩Trap给经验",
	71	=>"分解产出",
	72	=>"装备进阶魂", 
	73	=>"GM指令加积分",
	74	=>"角斗场副本加积分",
	75	=>"竞技场副本加积分",
	76	=>"PK状态下杀怪加积分",
	78	=>"玩家踩trap加钱",
	79	=>"大夺宝加钱",
	80	=>"帮会出售粮草",
	81	=>"玩家邮件提取钱",
	82	=>"往仓库存钱",
	83	=>"从仓库取钱",
	84	=>"GM指令加钱",
	85	=>"玩家交易",
	86	=>"喝酒扣钱",
	87	=>"购买交易所订单",
	88	=>"修装备扣钱",
	89	=>"学技能扣钱",
	90	=>"道具商城",
	91	=>"佣兵币兑换流通钱",
	92	=>"流通钱兑换绑定钱",
	93	=>"佣兵币兑换绑定佣兵币",
	94	=>"帮会解散删除物品",
	95	=>"帮会删除成员",
	96	=>"生活技能学习或升级",
	97	=>"Gm指令学习生活技能",
	98	=>"Gm指令加生活技能熟练度",
	99	=>"生活技能专精学习",
	100	=>"技能学习消耗魂",
	101	=>"商城购买",
	102	=>"商城赠送",
	103	=>"指引奖励",
	104	=>"玩家杀怪获得魂值",
	105	=>"gm发的邮件",
	106	=>"系统退回邮件",
	107	=>"寄售交易所邮件",
	108	=>"活动奖励邮件", 
	109	=>"种花系统邮件", 
	110	=>"积分赛奖励邮件",
	111	=>"背包满石头融合或鉴定邮件",
	112	=>"订单过期邮件",
	113	=>"购买订单成功邮件",
	114	=>"订单被成功购买邮件",
	115	=>"佣兵小队建筑制造",
	116	=>"佣兵小队取消物品制造",
	117	=>"佣兵小队物品制造", 
	118	=>"佣兵小队粮草收购", 
	119	=>"佣兵小队粮草出售", 
	120	=>"佣兵小队成员捐献金钱",
	121	=>"佣兵小队科技研发",
	122	=>"佣兵小队宣战",
	123	=>"佣兵小队宣战竞标失败",
	124	=>"佣兵小队GM指令加钱",
	125	=>"佣兵小队积分赛奖励",
	126	=>"佣兵小队抢夺资源点活动",
	127	=>"佣兵卡牌奖励",
	128	=>"佣兵小队杀人加功勋",
	129	=>"佣兵小队挑战时间到加荣誉",
	130	=>"佣兵小队挑战分出胜负加荣誉", 
	131	=>"佣兵小队建筑被打爆加荣誉",
	132	=>"佣兵小队npc驻地建筑被打爆加荣誉",
	133	=>"佣兵小队建筑打爆资源掉落", 
	134	=>"佣兵小队建筑修理", 
	135	=>"佣兵小队更新建筑等级", 
	136	=>"分解删除",
	137	=>"Boss争夺战奖励",
	138	=>"Pk状态杀死玩家加积分", 
	139	=>"道具商城余额领取",
	140	=>"大逃杀加积分", 
	141	=>"团商店购买物品", 
	142	=>"任务加佣兵券", 
	143	=>"杀npc增加团贡", 
	144	=>"任务帮会荣誉奖励", 
	145	=>"任务帮会团贡奖励", 
	146	=>"修行塔给绑定金币", 
	147	=>"拍卖竞价扣钱", 
	148	=>"拍卖竞价补钱", 
	149	=>"拍卖竞价返钱", 
	150	=>"拍卖OBJ消失返钱", 
	151	=>"拍卖系统返钱", 
	152	=>"拍卖平均分钱", 
	153	=>"npc商店购回",
	154	=>"表情动作",
	155	=>"挂机采矿产出",
	156	=>"创建佣兵团",
	157	=>"系统管理费",    
	158	=>"国贡商店购买物品", 
	159	=>"gm补偿",    
	160	=>"世界频道聊天扣钱", 
	161	=>"提升装备可强化上限", 
	162	=>"种花", 
	163	=>"掉落物品拍卖", 
	164	=>"代工厂制造", 
	165	=>"代工成功",   
	166	=>"Pk状态被杀死减积分", 
	167	=>"离线经验兑换",   
	168	=>"资源点队长奖励",  
	169	=>"佣兵小队GM指令加等级",
	170	=>"佣兵小队GM指令加荣誉",
	171	=>"佣兵小队GM指令加资源",
	172	=>"队友任务经验分享",
	173	=>"特殊NPC传送",   
	174	=>"抢夺资源点加国贡",
	175	=>"魂瓶满产生魂珠",
	176	=>"帮会挑战领取挑战建筑",
	177	=>"代工收费",
	178	=>"系统税收",
	179	=>"玩家转职",
	180	=>"佣兵小队拆除粮草仓扣除所有军资",
	181	=>"交易所添加订单管理费",
	182	=>"添加代工订单管理费",
	183	=>"技能学习管理费",
	184	=>"邮件管理费",	
	185	=>"取消代工订单回退金钱",
	186	=>"装备镶嵌护甲片扣钱",
	187	=>"传声频道发消息扣钱",
	188	=>"玩家交易扣税",
	189	=>"代工成功扣税",
	190	=>"寄售交易所扣税",
	191	=>"邮寄扣税",
	192	=>"拍卖分钱扣税",
	193	=>"代工订单制作",
	194	=>"添加代工订单",
	195	=>"手动取消代工所订单",
	196	=>"自动取消代工所订单",
	197	=>"掉落物品拍卖结果",
	198 =>"特殊NPC传送非绑定金币",
	199 =>"过期邮件删除",
	200 =>"装备追加消耗",
	201 =>"佣兵小队征粮扣钱",
	202 =>"佣兵小队类型提升扣钱",
	203 =>"gm工具给佣兵小队仓库加物品",
	204 =>"gm恢复装备",
	205 =>"佣兵小队补偿资金",
	206 =>"佣兵小队补偿军资",
	207 =>"WebShop购买物品",
	208 =>"添加求购订单",
	209 =>"手动删除收购订单",
	210 =>"出售收购订单",
	211 =>"收购订单成功邮件",
	212 =>"收购订单超时删除",
	213 =>"收购订单超时邮件",
	214 =>"收购订单完成删除",
	215	=>"收购订单管理费",
	216	=>"佣兵小队发展度满足升级",
	217	=>"任务加发展度奖励",
	218	=>"怪物攻城奖励",
	219	=>"重金招募奖励",
	220	=>"篝火活动",
	221	=>"GM加发展度奖励",
	222	=>"服务器星级奖励",
	223	=>"佣兵小队转类型扣钱",
	224	=>"抢夺资源点获胜",
	225	=>"玩家捐钱换经验",
	226	=>"玩家捐钱换魂值",
	227	=>"玩家捐钱换军资",
	228	=>"购买点券",
	229	=>"学习佣兵小队科技",
	230	=>"使用VIP道具获得物品",
	231	=>"VIP邮件物品",
	232	=>"VIP邮件",
	233	=>"佣兵小队补偿荣誉",
	
	10001	=> "佣兵小队仓库",
	10002 => "玩家交易信息",
);

$tbl_log_vir_wealth = array(
	"查看虚拟财产日志",
	"角色名:%s(角色ID:%s)",
	"角色升级情况：",
	array("等级","时间"),
	"角色经验情况",
	array("来源","经验"),
	"角色金钱情况",
	array("操作类型","金钱类型","操作次数","总操作金钱","平均操作金钱"),
	"角色魂值情况",
	array("操作类型","操作次数","总操作魂值","平均操作魂值"),
	"角色积分情况",
	array("积分类型","操作类型","操作次数","总操作积分","平均操作积分"),
	"角色物品情况",
	array("得到","失去","操作类型","操作次数"),
);

$tbl_log_item_flow = array("得到","失去");

$tbl_market = array(
	"title"							=> "寄售交易所&nbsp;-&nbsp;%s",
	"giver_item_list"		=> array("寄售物品分布",	array("物品名","订单数","总数量","总售价")),
	"taker_item_list"		=> array("购买物品分布",	array("物品名","订单数","总数量","总售价")),
	"order_list"				=> array("订单情况",			array("操作类型","订单数","总寄售物品数","总售价")),
);

$tbl_gm_log_user = array(
	"role" => array("role_detail_"=>"查看角色详情","role_select"=>"勾选角色","role_filter"=>"查看与该角色有关的记录"),
	"user" => array("user_detail"=>"查看帐号详情","user_select"=>"勾选帐号","user_filter"=>"查看与该帐号有关的记录"),
	"tong" => array("tong_detail"=>"查看帮会","tong_filter"=>"查看与该帮会有关的记录")
);

$tbl_item_is_binding = array("","装备后绑定","已绑定");
$tbl_role_equip_info = array(
	"耐久度：%d/%d",
	array(
		array("%d-%d伤害","速度 %.1f","(每秒伤害%.1f)"),
		array("护甲值","自然抗值","破坏抗值"),
		array("攻击力：%.1f"),
	),
	"%s进阶",
	"%s强化",
	"累计强化%d次",
	"幸运值&nbsp;%d/150",
	"追加",
	"级",
	"(%s)套装：",
	"隐藏效果："
);

$tbl_modulus_type = array(
	2	=>	"经验值",
	4	=>	"魂值",
);

$tbl_server_info = array(
	array("服务器变量","时间","人数","排队服务器：","排队人数：","副本数目","副本人数","区域副本数目"),
	array("进程人数分布","人数","进程","服务器"),
	array("主场景人数分布","进程","人数(含在此传送进副本的人数)","活动角色数目","场景名"),
	array("副本统计","副本名称","副本数目","人数"),
	array("进程副本统计","进程","副本数目","人数"),
);

$tbl_item_inten_soul = array(
	"1b3J8Q" => "物理攻击",
	"t6jEpw" => "法术攻击",
);

$tbl_log_desc = array(
	1		=> array("通过NPC[%s]","购买[%d]个[%s]","花费[%s][%s]"),
	2		=> array("通过NPC[%s]","卖出[%d]个[%s]","得到[%s][%s]"),
	3		=> array("从[%s]","向[%s]","发送邮件"),
	16	=> array("在寄售交易所发布订单<br/>出售[%s]个[%s]，售价[%s]","该订单于[%s]被[%s]购得"),
	18	=> array("在寄售交易所从玩家[%s]的订单<br/>购买[%s]个[%s]，花费[%s]"),
	42	=> "完成任务[%s]",
	85	=> array("玩家[%s]与玩家[%s]交易，<br/>","使用“%s”，<br/>交换“%s”","[%1\$d]个[%2\$s]","[流通金][%1\$s]","、"),
	153	=> "通过NPC[%s]，<br/>购回[%d]个[%s]，<br/>花费[%s][%s]",
	10002=> "请查看与当前记录同时发生的金钱数量为空的“玩家交易”记录，这两条记录为同一事件。",
);
$tbl_equip_upgrade_type = array(
	"intensify"					=>	array("装备强化",		""),
	"intensifyAddAttr"	=>	array("精炼后强化",	""),
	"armor"							=>	array("镶嵌护甲片",	"在位置%d，装入第%d个护甲片[%s]"),
	"advance"						=>	array("装备进阶",		""),
	"superaddation"			=>	array("装备追加",		"装备追加至第%d阶段"),
);
$tbl_market_buy_order = array(
	"由[%s]出售[%d]个物品",
	"总计购得[%d]个物品",
	"订单由于[%s]被删除",
	array(
		209 => "玩家操作",
		212 => "超过时间",
		214 => "满足数量"
	),
);
$tbl_JingLing_type = array(
	"u-A"	=>	"火",
	"tdg"	=>	"地",
	"t+c"	=>	"风",
	"y64"	=>	"水",
	"sfk"	=>	"冰",
);
$tbl_tong_depot_log = array("","取出","存入","奖励");
?>
