
create table tbl_item_tmp(name varchar(32) not null, key(name));
insert into tbl_item_tmp values
("1级矿藏图"),
("2级矿藏图"),
("3级矿藏图"),
("4级矿藏图"),
("5级矿藏图"),
("6级矿藏图"),
("7级矿藏图"),
("8级矿藏图"),
("9级矿藏图"),
("10级矿藏图") ,
("矿藏图"),
("试炼矿藏图"),
("试炼矿藏图（艾米）"),
("试炼矿藏图（神圣）"),
("试炼矿藏图（修斯）"),
("1级矿藏图（积分）"), 
("2级矿藏图（积分）"), 
("3级矿藏图（积分）"), 
("4级矿藏图（积分）"), 
("5级矿藏图（积分）"), 
("6级矿藏图（积分）"), 
("7级矿藏图（积分）"), 
("8级矿藏图（积分）"), 
("9级矿藏图（积分）"), 
("10级矿藏图（积分）"),
("1级金属矿图"),
("2级金属矿图"),
("3级金属矿图"),
("4级金属矿图"),
("5级金属矿图"),
("6级金属矿图"),
("7级金属矿图"),
("8级金属矿图"),
("9级金属矿图"),
("10级金属矿图"),
("1级猛兽矿图"),
("2级猛兽矿图"),
("3级猛兽矿图"),
("4级猛兽矿图"),
("5级猛兽矿图"),
("6级猛兽矿图"),
("7级猛兽矿图"),
("8级猛兽矿图"),
("9级猛兽矿图"),
("10级猛兽矿图"),
("1级水晶矿图"),
("2级水晶矿图"),
("3级水晶矿图"),
("4级水晶矿图"),
("5级水晶矿图"),
("6级水晶矿图"),
("7级水晶矿图"),
("8级水晶矿图"),
("9级水晶矿图"),
("10级水晶矿图");

create table tbl_item_del
select 
isc.is_uId
from 
tbl_item_oremap io,tbl_item_static isc,tbl_item_tmp it
where
io.is_uId = isc.is_uId and is_sName = name;

delete from tbl_item_oremap where is_uId in(select is_uId from tbl_item_del);

drop table tbl_item_tmp;
drop table tbl_item_del;